# Даны значения зарплат из выборки выпускников: 100, 80, 75, 77, 89, 33, 45, 25, 65, 17, 30, 24, 57, 55, 70, 75, 65, 84,
# 90, 150. Посчитать (желательно без использования статистических методов наподобие std, var, mean) среднее арифметическое,
# среднее квадратичное отклонение, смещенную и несмещенную оценки дисперсий для данной выборки.


import math

salaries = [100, 80, 75, 77, 89, 33, 45, 25, 65, 17, 30, 24, 57, 55, 70, 75, 65, 84, 90, 150]

mean = sum(salaries) / len(salaries)
print(f'Cреднее арифметическое = {mean: .2f}')

# σ = √ ( ( ∑ ( xi - μ )² ) / N )
std = math.sqrt(sum((x - mean) ** 2 for x in salaries) / len(salaries))
print(f'Cреднее квадратичное отклонение = {std: .2f}')

# σ² = (∑ (xi - μ)²) / N
var = sum((x - mean) ** 2 for x in salaries) / len(salaries)
print('Смещенная оценка дисперсии = ', var)


unbiasedvar = sum((x - mean) ** 2 for x in salaries) / (len(salaries) - 1)
print(f'Несмещенная оценка дисперсии = {unbiasedvar: .2f}')
